#ifndef __DCMI_H
#define __DCMI_H
#include "./SYSTEM/sys/sys.h"
//////////////////////////////////////////////////////////////////////////////////	 

/************************************************************************************************/

//DCMI驱动代码	   

//STM32H7工程模板-HAL库函数版本





/************************************************************************************************/							  
////////////////////////////////////////////////////////////////////////////////// 	

extern void (*dcmi_rx_callback)(void);//DCMI DMA接收回调函数

extern DCMI_HandleTypeDef DCMI_Handler;        //DCMI句柄
extern DMA_HandleTypeDef  DMADMCI_Handler;     //DMA句柄

void DCMI_Init(void);
void DCMI_DMA_Init(u32 mem0addr,u32 mem1addr,u32 memsize,u32 memblen,u32 meminc);
void DCMI_Start(void);
void DCMI_Stop(void);

#endif




































/************************************************************************************************/

//DCMI驱动代码	   

//STM32H7工程模板-HAL库函数版本





/************************************************************************************************/	
